Revit 2026 API

# SiteSubRegion Methods

---

The SiteSubRegion type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Create(Document, IListCurveLoop) | **Obsolete.** |
|  | Create(Document, IListCurveLoop, ElementId) | **Obsolete.** |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetBoundary | Gets the boundary of current subregion. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsValidBoundary |  |
|  | SetBoundary | **Obsolete.** |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

SiteSubRegion Class

Autodesk.Revit.DB.Architecture Namespace